1s/ERP/Conf/Documents/Лико_ЗаданиеНаУдалениеГП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаданиеНаУдалениеГП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрдерныеСклады</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыпуска</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаявокНаТранспортировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаявокНаТранспортировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыСкладовГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыСкладовГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регион</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараКлиентаУНас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеНашегоТовараУКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыОтгрузкиГотовойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыОтгрузкиГотовойПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладРегиона2</Name>
					<Comment>В программе делает тоже самое, что и "ПеремещениеНаСкладРегиона"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуИСписаниеСОрганизацииПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСОрганизацииПроизводителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуСПеремещениемНаСкладХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеКлиентуСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСоСкладаХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладамиХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиентуЧерезСкладРегиона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаСкладОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСоСкладаОтвХраненияДругойПлощадки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаданиеНаУдалениеГП/Ext/ObjectModule.bsl
Перем КлючиСтруктуры;
Перем СтруктураСоответствияТЧ;
Перем ОрганизацияПродавецКлиенту;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ Отказ Тогда
		Отказ = НЕ СоздатьТиповыеДокументы();
	КонецЕсли;
	
	Если НЕ Отказ И ДополнительныеСвойства.Свойство("МассивПричинОтправкиПисьма") И ДополнительныеСвойства.МассивПричинОтправкиПисьма <> Неопределено Тогда
		// Отправим письмо
		ОтправитьПисьмо(ДополнительныеСвойства.МассивПричинОтправкиПисьма);
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТиповыеДокументы() Экспорт
	
	НачатьТранзакцию();
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	ТаблицаНовыхДокументов.Колонки.Добавить("Документ");
	ТаблицаНовыхДокументов.Колонки.Добавить("Склад");
	
	// Перед тем как создавать, нужно сначала их все пометить на удаление
	СтруктураТиповыхДокументовУдаление = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка,,"ЗаписьИзЗаданияНаСписаниеГП");
	Если СтруктураТиповыхДокументовУдаление = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
			
		ТаблицаТоваров = СформироватьТаблицуТоваров();
		Для каждого Строка из ТаблицаТоваров Цикл
			Если НЕ ЗначениеЗаполнено(Строка.Склад) Тогда
				Сообщить("Не для всех строк определился склад. Возможно в таблице есть склад брака, для которого не удалось найти связанный склад производства");
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ПредыдущийСклад = Неопределено;
		
		Для каждого Строка из ТаблицаТоваров Цикл
			
			ТекущийСклад = Строка.Склад;
			
			Если ПредыдущийСклад = Неопределено ИЛИ ПредыдущийСклад <> ТекущийСклад Тогда
				
				СтруктураТиповыхДокументовСклад = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(, Новый Структура("Склад", ТекущийСклад), КлючиСтруктуры, Ссылка, Ложь);
				
				ТаблицаТоваровПоСкладу = ТаблицаТоваров.Скопировать(Новый Структура("Склад", ТекущийСклад));
				Если ОрдерныеСклады Тогда
					// Создаем заявку на отгрузку
					НовыйДокументЛико_ЗаякаНаОтгрузку = СоздатьДокументЛико_ЗаявкаНаОтгрузку(ТаблицаТоваровПоСкладу, СтруктураТиповыхДокументовСклад.Лико_ЗаявкаНаОтгрузку);
					Если НовыйДокументЛико_ЗаякаНаОтгрузку = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
					НоваяСтрока.Документ = НовыйДокументЛико_ЗаякаНаОтгрузку;
					НоваяСтрока.Склад = ТекущийСклад;
				Иначе
					// Создаем списание товаров на доп. расходы
					СтруктураПараметров = Новый Структура("Склад,Организация,ЭтоСписаниеСПроизводителя,Дата,Ответственный,Основание", ТекущийСклад, Организация, Ложь, ДатаСписания, Менеджер, Ссылка);
					НовыйДокументВнутреннееПотребление = Лико_Дополнительно.СоздатьДокументВнутреннееПотребление(ТаблицаТоваровПоСкладу, СтруктураТиповыхДокументовСклад.ВнутреннееПотребление, СтруктураПараметров);
					Если НовыйДокументВнутреннееПотребление = Неопределено Тогда
						// --> Начало Лико Ефимов ЕВВ 21.08.2025
						// Попробуем удалить строки, по которым нет остатка
						МассивСтрокКУдалению = Новый Массив;
						Для каждого СтрокаТаблицыТоваровПоСкладу из ТаблицаТоваровПоСкладу Цикл
							Если СтрокаТаблицыТоваровПоСкладу.Остаток <= 0 Тогда
								// Удалим строку
								МассивСтрокКУдалению.Добавить(СтрокаТаблицыТоваровПоСкладу);
							ИначеЕсли СтрокаТаблицыТоваровПоСкладу.Остаток < СтрокаТаблицыТоваровПоСкладу.Количество Тогда
								// Уменьшим количество
								СтрокаТаблицыТоваровПоСкладу.Количество = СтрокаТаблицыТоваровПоСкладу.Остаток;
								СтрокаТаблицыТоваровПоСкладу.КоличествоОтгружено = СтрокаТаблицыТоваровПоСкладу.Остаток;
							КонецЕсли;
						КонецЦикла; 
						Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл 
							ТаблицаТоваровПоСкладу.Удалить(СтрокаКУдалению);
						КонецЦикла;
						Если ТаблицаТоваровПоСкладу.Количество() = 0 Тогда
							// Не осталось строк с остатком, не будем создавать внутреннее потребление
							Возврат Истина; 
						Иначе
							НовыйДокументВнутреннееПотребление = Лико_Дополнительно.СоздатьДокументВнутреннееПотребление(ТаблицаТоваровПоСкладу, СтруктураТиповыхДокументовСклад.ВнутреннееПотребление, СтруктураПараметров);
						КонецЕсли;
						Если НовыйДокументВнутреннееПотребление = Неопределено Тогда
							// Не помогло
							Возврат Ложь;
						КонецЕсли;
						// <-- Конец Лико Ефимов ЕВВ 21.08.2025
					КонецЕсли;
					НоваяСтрока = ТаблицаНовыхДокументов.Добавить();
					НоваяСтрока.Документ = НовыйДокументВнутреннееПотребление;
					НоваяСтрока.Склад = ТекущийСклад;
				КонецЕсли;
				
			КонецЕсли;
			
			ПредыдущийСклад = ТекущийСклад;
			
		КонецЦикла;
		
		// Запишем типовые документы в регистр Лико_СвязиСТиповымиДокументами
		Результат = Лико_Дополнительно.ЗаписатьТиповыеДокументыВРегистрЛико_СвязиСТиповымиДокументами(ТаблицаНовыхДокументов, Ссылка);
		Если НЕ Результат Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ТаблицаНовыхДокументов", ТаблицаНовыхДокументов);
		
	КонецЕсли;
		
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьТаблицуТоваров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Родитель КАК Родитель,
		|	МАКСИМУМ(Склады.Ссылка) КАК СкладПроизводства
		|ПОМЕСТИТЬ ВТ_СкладыПроизводства
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Производство)
		|	И НЕ Склады.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Склады.Родитель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Остаток
		|ПОМЕСТИТЬ ВТ_ОстаткиНеордерных
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			(Номенклатура, Характеристика, Склад) В
		|				(ВЫБРАТЬ
		|					ВЫРАЗИТЬ(Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|					Лико_ЗаданиеНаУдалениеГПТовары.Характеристика КАК Характеристика,
		|					Лико_ЗаданиеНаУдалениеГПТовары.Склад КАК Склад
		|				ИЗ
		|					Документ.Лико_ЗаданиеНаУдалениеГП.Товары КАК Лико_ЗаданиеНаУдалениеГПТовары
		|				ГДЕ
		|					Лико_ЗаданиеНаУдалениеГПТовары.Ссылка = &Ссылка
		|					И НЕ Лико_ЗаданиеНаУдалениеГПТовары.Отменить
		|					И НЕ Лико_ЗаданиеНаУдалениеГПТовары.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|				СГРУППИРОВАТЬ ПО
		|					Лико_ЗаданиеНаУдалениеГПТовары.Склад,
		|					ВЫРАЗИТЬ(Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Владелец КАК Справочник.Номенклатура),
		|					Лико_ЗаданиеНаУдалениеГПТовары.Характеристика)) КАК ТоварыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Характеристика,
		|	ТоварыНаСкладахОстатки.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Лико_ЗаданиеНаУдалениеГПТовары.Склад.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|			ТОГДА ВТ_СкладыПроизводства.СкладПроизводства
		|		ИНАЧЕ Лико_ЗаданиеНаУдалениеГПТовары.Склад
		|	КОНЕЦ КАК Склад,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры КАК ЗаказКлиента,
		|	ВЫРАЗИТЬ(Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика КАК Характеристика,
		|	СУММА(Лико_ЗаданиеНаУдалениеГПТовары.Количество) КАК Количество,
		|	СУММА(Лико_ЗаданиеНаУдалениеГПТовары.Количество) КАК КоличествоОтгружено,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры.Контрагент КАК Контрагент,
		|	Лико_ЗаданиеНаУдалениеГПТовары.НомерПоставки КАК НомерПоставки,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры.ВалютаДляДокументов КАК ВалютаЦены,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Намотка КАК Намотка,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Город КАК Город,
		|	Лико_ЗаданиеНаУдалениеГПТовары.КодЭтикеткиЗаказчика КАК КодЭтикеткиЗаказчика,
		|	Лико_ЗаданиеНаУдалениеГПТовары.ЧестныйЗнак КАК ЧестныйЗнак,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	МАКСИМУМ(Лико_ЗаданиеНаУдалениеГПТовары.НомерСтроки) КАК НомерСтроки,
		|	СУММА(ЕСТЬNULL(ВТ_ОстаткиНеордерных.Остаток, 0)) КАК Остаток
		|ИЗ
		|	Документ.Лико_ЗаданиеНаУдалениеГП.Товары КАК Лико_ЗаданиеНаУдалениеГПТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыПроизводства КАК ВТ_СкладыПроизводства
		|		ПО Лико_ЗаданиеНаУдалениеГПТовары.Склад.Родитель = ВТ_СкладыПроизводства.Родитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНеордерных КАК ВТ_ОстаткиНеордерных
		|		ПО Лико_ЗаданиеНаУдалениеГПТовары.Склад = ВТ_ОстаткиНеордерных.Склад
		|			И Лико_ЗаданиеНаУдалениеГПТовары.Характеристика = ВТ_ОстаткиНеордерных.Характеристика
		|ГДЕ
		|	Лико_ЗаданиеНаУдалениеГПТовары.Ссылка = &Ссылка
		|	И НЕ Лико_ЗаданиеНаУдалениеГПТовары.Отменить
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Лико_ЗаданиеНаУдалениеГПТовары.Склад.Лико_ТипСкладаГотовойПродукции = ЗНАЧЕНИЕ(Перечисление.Лико_ТипыСкладовГотовойПродукции.Брак)
		|			ТОГДА ВТ_СкладыПроизводства.СкладПроизводства
		|		ИНАЧЕ Лико_ЗаданиеНаУдалениеГПТовары.Склад
		|	КОНЕЦ,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры,
		|	ВЫРАЗИТЬ(Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Владелец КАК Справочник.Номенклатура),
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры.Контрагент,
		|	Лико_ЗаданиеНаУдалениеГПТовары.НомерПоставки,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Характеристика.Лико_ЗаказНоменклатуры.ВалютаДляДокументов,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Намотка,
		|	Лико_ЗаданиеНаУдалениеГПТовары.Город,
		|	Лико_ЗаданиеНаУдалениеГПТовары.КодЭтикеткиЗаказчика,
		|	Лико_ЗаданиеНаУдалениеГПТовары.ЧестныйЗнак
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция СоздатьДокументЛико_ЗаявкаНаОтгрузку(Таблица, УжеСозданныйДокумент = Неопределено) Экспорт

	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	НовыйДокОбъект = Документы.Лико_ЗаявкаНаОтгрузку.СоздатьДокумент();
	НовыйДокОбъект.Дата = ДатаСписания;
	НовыйДокОбъект.ДатаОтгрузки = НовыйДокОбъект.Дата;
	НовыйДокОбъект.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден;
	НовыйДокОбъект.Организация = Организация;
	НовыйДокОбъект.Склад = Таблица[0].Склад;
	Если ЗначениеЗаполнено(НовыйДокОбъект.Склад.Лико_Площадка) Тогда
		НовыйДокОбъект.Площадка = НовыйДокОбъект.Склад.Лико_Площадка;
	Иначе
		// Раньше было так написано, может и не имеет смысла
		НовыйДокОбъект.Площадка = Справочники.Лико_Площадки.ПлощадкаПоОрганизации(НовыйДокОбъект.Организация);
	КонецЕсли;
	НовыйДокОбъект.Ответственный = Менеджер;
	НовыйДокОбъект.Комментарий = "Создан автоматически на основании документа """ + Ссылка + """";
	НовыйДокОбъект.ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя;
	НовыйДокОбъект.ОрганизацияПродавец = Таблица[0].ЗаказКлиента.Организация;
	НовыйДокОбъект.СозданаНаОснованииЗаданияНаСписаниеГП = Истина;

	Для каждого Строка из Таблица Цикл
		НоваяСтрока = НовыйДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

	Если УжеСозданныйДокумент <> Неопределено Тогда
		УжеСозданныйДокументОбъект = УжеСозданныйДокумент.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(УжеСозданныйДокументОбъект, НовыйДокОбъект,,"Ссылка,Номер");
		Для Каждого	ТабличнаяЧасть из УжеСозданныйДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			УжеСозданныйДокументОбъект[ТабличнаяЧасть.Имя].Загрузить(НовыйДокОбъект[ТабличнаяЧасть.Имя].Выгрузить());
		КонецЦикла;
		НовыйДокОбъект = УжеСозданныйДокументОбъект;
	КонецЕсли;

	НовыйДокОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзЗаданияНаСписаниеГП", Истина);

	Попытка
		НовыйДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Отказ = Истина;
		Сообщить("Документ """ + НовыйДокОбъект + """ не удалось провести! Транзакция по созданию типовых документов отменена. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат НовыйДокОбъект.Ссылка;

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ ДополнительныеСвойства.Свойство("РазрешеноМенятьЗакрытуюЗаявку") И НЕ ДополнительныеСвойства.Свойство("ЗаписьИзОтборРазмещениеТоваров") Тогда
		Сообщить("Заявка уже закрыта. Изменения запрещены");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И НЕ ЗначениеЗаполнено(ДатаСписания) Тогда
		Сообщить("Для закрытия задания необходимо заполнить дату списания");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И Товары.Количество() = 0 Тогда
		Сообщить("Для закрытия задания необходимо заполнить товары");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из Товары Цикл
		Если Строка.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке <> ОрдерныеСклады Тогда
			Сообщить("Различается признак ордерных складов в шапке документа и в строке №" + Строка.НомерСтроки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Найти(Истина, "Отменить") <> Неопределено Тогда 
		Если НЕ ЗначениеЗаполнено(КомментарийМенеджера) Тогда
			Сообщить("В документе есть отмененные строки. Необходимо заполнить комментарий менеджера");
			Отказ = Истина;
		КонецЕсли;
		
		Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан Тогда
			Сообщить("В документе есть отмененные строки. Необходимо нажать ""Подтвердить""");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		МассивПричинОтправкиПисьма = ПроверитьНеобходимостьОтправкиПисьма();
		Если НЕ ЗначениеЗаполнено(МассивПричинОтправкиПисьма) Тогда
			МассивПричинОтправкиПисьма = Неопределено;
		КонецЕсли;
		ДополнительныеСвойства.Вставить("МассивПричинОтправкиПисьма", МассивПричинОтправкиПисьма);
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НачатьТранзакцию();
	//Пометим на удаление связанные типовые документы

	СтруктураТиповыхДокументов = Лико_Дополнительно.НайтиУжеСформированныеТиповыеДокументы(Истина,, КлючиСтруктуры, Ссылка);
	Если СтруктураТиповыхДокументов = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		ЗафиксироватьТранзакцию();	
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьПисьмо(МассивПричинОтправкиПисьма)
	
	ИмяФайлаПФ = ПолучитьИмяВременногоФайла();
	ВнОбработка = Лико_Дополнительно.НайтиДополнительнуюОбработкуПоИмениОбъекта("ПечатнаяФормаЗаданиеНаУдалениеГП");
	Если НЕ ЗначениеЗаполнено(ВнОбработка) Тогда
		Сообщить("В справочнике предопределенных значений не найдена печатная форма ""Задание на удаление ГП""");
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = ВнОбработка.ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяФайлаПФ);
	ВнешняяПФ = ВнешниеОбработки.Создать(ИмяФайлаПФ, Ложь);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Ссылка);
	
	Если МассивПричинОтправкиПисьма.Найти("Изменение") <> Неопределено Тогда
		ТабДок = ВнешняяПФ.СформироватьПечатнуюФормуЗаданиеНаУдалениеГП(МассивОбъектов, Неопределено, Новый Структура("ФильтрОтмененных", Истина));
		Если ТабДок <> Неопределено Тогда
			ИмяФайла = КаталогВременныхФайлов() + "Списание ГП по менеджеру " + Менеджер + " " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yy") + ".xlsx";
			ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		Иначе
			ИмяФайла = Неопределено;
		КонецЕсли;
		
		Тема = "Запрос на отмену утилизации старых этикеток от " + Менеджер;
		Текст = "Добрый день" + "<br><br>" + Символы.ПС
				+ "Направляю запрос на отмену утилизации этикеток, список которых находится в приложенном файле." + "<br><br>" + Символы.ПС 
				+ СокрЛП(КомментарийМенеджера) + "<br><br>" + Символы.ПС 
				+ Ссылка;	
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить(Менеджер);
		Если Менеджер.Наименование = "Панов Евгений" Тогда
			СписокПолучателей.Добавить("akrimkina@okil-sato.ru");
		КонецЕсли;
		СписокПолучателей.Добавить("den.okulov@gmail.com"); // Окулову только при подтверждении и при изменении подтвержденной заявки, раскомментировать
		СписокПолучателей.Добавить("aivanova@okil.ru"); // Анне всегда
		//СписокПолучателей.Добавить("vefimov@okil.ru"); // Мне на время тестов
		ДиректорРегиона = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Менеджер.Лико_Регион, "Лико_Директор");
		Если ЗначениеЗаполнено(ДиректорРегиона) Тогда
			СписокПолучателей.Добавить(ДиректорРегиона);
		КонецЕсли;
		Лико_Планирование.ОтправитьПисьмо(Текст, Тема, СписокПолучателей,,,,, ИмяФайла);
	КонецЕсли;
	Если МассивПричинОтправкиПисьма.Найти("Закрытие") <> Неопределено Тогда
		ТабДок = ВнешняяПФ.СформироватьПечатнуюФормуЗаданиеНаУдалениеГП(МассивОбъектов, Неопределено, Новый Структура("ФильтрОтмененных", Ложь));
		Если ТабДок <> Неопределено Тогда
			ИмяФайла = КаталогВременныхФайлов() + "Списание ГП по менеджеру " + Менеджер + " " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yy") + ".xlsx";
			ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		Иначе
			ИмяФайла = Неопределено;
		КонецЕсли;
		
		Тема = "Закрыто задание на утилизацию старых этикеток от " + Менеджер;
		Текст = "Добрый день" + "<br><br>" + Символы.ПС
				+ "Закрыто " + Ссылка + " по менеджеру " + Менеджер + ". При закрытии сформированы следуюшие документы:";
		
		СписокПолучателей = Новый СписокЗначений;
		СписокПолучателей.Добавить(Менеджер);
		Если Менеджер.Наименование = "Панов Евгений" Тогда
			СписокПолучателей.Добавить("akrimkina@okil-sato.ru");
		КонецЕсли;
		СписокПолучателей.Добавить("aivanova@okil.ru"); // Анне всегда
		//СписокПолучателей.Добавить("vefimov@okil.ru"); // Мне на время тестов
		Для каждого Строка из ДополнительныеСвойства.ТаблицаНовыхДокументов Цикл
			Текст = Текст + "<br>" + Символы.ПС + " - " + Строка.Документ;
			АдресОтветственногоПоСкладу = Лико_Дополнительно.НайтиЭлектронныйАдресОтветственногоПоСкладу(Строка.Склад, "лк Адрес для отправки писем об автоматическом списании");
			Если ЗначениеЗаполнено(АдресОтветственногоПоСкладу) Тогда
				// Ответственный по складу
				СписокПолучателей.Добавить(АдресОтветственногоПоСкладу);
			КонецЕсли;
		КонецЦикла;				
		Лико_Планирование.ОтправитьПисьмо(Текст, Тема, СписокПолучателей,,,,, ИмяФайла);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайлаПФ);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ПроверитьНеобходимостьОтправкиПисьма()
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеОтправлятьПисьма") И ДополнительныеСвойства.НеОтправлятьПисьма Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьОтмененныеСтроки = Товары.Найти(Истина, "Отменить") <> Неопределено;
	ЕстьНеотмененныеСтроки = Товары.Найти(Ложь, "Отменить") <> Неопределено;
	
	МассивПричинОтправкиПисьма = Новый Массив;
	
	Если Ссылка.Статус <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И ЕстьНеотмененныеСтроки Тогда
		// Заявка была не закрыта, а сейчас закрыта
		МассивПричинОтправкиПисьма.Добавить("Закрытие");
	КонецЕсли;

	Если Ссылка.Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан И Статус <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан Тогда
		// Изменили статус с Создан на любой другой
		Если ЕстьОтмененныеСтроки И ЗначениеЗаполнено(Менеджер.Лико_Регион) Тогда
			МассивПричинОтправкиПисьма.Добавить("Изменение");
		КонецЕсли;
		Возврат МассивПричинОтправкиПисьма;
	КонецЕсли;
	
	КолонкиДляГруппировки = "";
	КолонкиДляСуммирования = "Количество";
	Для каждого Реквизит из Метаданные().ТабличныеЧасти.Товары.Реквизиты Цикл
		Если Реквизит.Имя = "НомерСтроки" ИЛИ Реквизит.Имя = "Количество" Тогда
			Продолжить;
		КонецЕсли;
		КолонкиДляГруппировки = КолонкиДляГруппировки + ?(ЗначениеЗаполнено(КолонкиДляГруппировки), ",", "") + Реквизит.Имя;
	КонецЦикла;
	
	ТЗДоИзменений = Ссылка.Товары.Выгрузить();
	ТЗДоИзменений.Свернуть(КолонкиДляГруппировки, КолонкиДляСуммирования);
	ТЗСейчас = Товары.Выгрузить();
	ТЗСейчас.Свернуть(КолонкиДляГруппировки, КолонкиДляСуммирования);
	ТаблицыНЕСовпадают = Лико_Дополнительно.СравнениеДвухОдинаковыхТаблицЗначенийПоСодержимому(ТЗДоИзменений, ТЗСейчас);
	
	Если ТаблицыНЕСовпадают Тогда
		// Заявку поменяли
		Если ЗначениеЗаполнено(Менеджер.Лико_Регион) Тогда
			МассивПричинОтправкиПисьма.Добавить("Изменение");
		КонецЕсли;

		Если Статус = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт
			И ЕстьНеотмененныеСтроки
			И МассивПричинОтправкиПисьма.Найти("Закрытие") = Неопределено // Причем она была уже закрыта
			Тогда
			МассивПричинОтправкиПисьма.Добавить("Закрытие");
		КонецЕсли;
	КонецЕсли;
	
	Если МассивПричинОтправкиПисьма.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивПричинОтправкиПисьма;
	КонецЕсли;
	
КонецФункции


КлючиСтруктуры =	"ВнутреннееПотребление,
					|Лико_ЗаявкаНаОтгрузку";
